# Part 1 : Most simplest LAN

## 1. Intro

![Topologie nÂ°1](assets/img/topo1.png)

???+ note

    Pour cette partie on a juste besoin de "clients rÃ©seau" : un machin qui a une carte rÃ©seau et peut donc avoir une adresse IP. Envoyer des `ping` pour tester. Et c'est tout, Ã§a nous va.  
    Donc vous pouvez utiliser des VMs Rocky si vous voulez, **mais sinon, GNS3 propose les VPCS : des clients rÃ©seau ultra simpliste.**  
    Je vous recommande trÃ¨s fort d'utiliser Ã§a pour Ã©conomiser des ressources et pas attendre 15 plombes aprÃ¨s vos VMs.

**Un LAN (ou "RÃ©seau Local" en franÃ§ais) c'est juste un rÃ©seau formÃ© de plusieurs machines connectÃ©es PHYSIQUEMENT entre elles.**

Pour Ã§a, chaque machine a besoin d'au moins **une carte rÃ©seau** (ou *interface rÃ©seau* ou encore *NIC* pour *Network Interface Controller*).  
Et on relie par des cÃ¢bles les machines entre elles. (Merci captain obvious ?)

**On va donc commencer au plus simple : deux machines connectÃ©es par un cÃ¢ble.**

Les objectifs de cette partie :

- monter la topologie dans GNS3 *(drag'n'drop des machins et tirer des cÃ¢bles dans GNS3)*
- dÃ©finir des IPs sur les deux machines
- visualiser l'IP choisie, ainsi que l'adresse MAC prÃ©determinÃ©e
- vÃ©rifier que les deux machines peuvent communiquer en faisant un `ping`
- visualiser le `ping` avec Wireshark

![Not sure](assets/meme/notsure.png)

## 2. Tableau d'adressage

Vous utiliserez les IPs suivantes pour cette partie :

| Machine           | Adresse IP    |
| ----------------- | ------------- |
| `node1.tp1.efrei` | `10.1.1.1/24` |
| `node2.tp1.efrei` | `10.1.1.2/24` |

??? warning

    Dans aucun des TPs je ne tolÃ©rerai que vous choisissiez/mettiez d'autres adresses que celles que j'indique, quand j'en indique.  
    La raison est simple : vous imposer une adresse, c'est une contrainte. Vous ne pouvez pas choisir une yolo facilitÃ© qui sortirai de j'sais pas oÃ¹ (genre le DHCP de Vbox).  
    Ca vous oblige Ã  faire du setup manuel. C'EST PEDAGOGIQUE EN FAIT EN FAIT.

---

## 3. Know your MAC

ğŸŒ **DÃ©terminer l'adresse MAC de vos deux machines**

node1.tp1.efrei
```
VPCS> show

NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
VPCS1  10.1.1.1/24          0.0.0.0           00:50:79:66:68:00  10004  127.0.0.1:10005
       fe80::250:79ff:fe66:6800/64
```


node2.tp1.efrei
```
VPCS> show

NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
VPCS1  10.1.1.2/24          0.0.0.0           00:50:79:66:68:01  10002  127.0.0.1:10003
       fe80::250:79ff:fe66:6801/64
```

## 4. IP Setup

ğŸŒ **DÃ©finir une IP statique sur les deux machines**

node1.tp1.efrei
```
VPCS> ip 10.1.1.1
Checking for duplicate address...
PC1 : 10.1.1.1 255.255.255.0
```

node2.tp1.efrei
```
VPCS> ip 10.1.1.2
Checking for duplicate address...
PC1 : 10.1.1.2 255.255.255.0
```
ğŸŒ **Proof !**

node1.tp1.efrei
```
VPCS> show

NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
VPCS1  10.1.1.1/24          0.0.0.0           00:50:79:66:68:00  10004  127.0.0.1:10005
       fe80::250:79ff:fe66:6800/64
```


node2.tp1.efrei
```
VPCS> show

NAME   IP/MASK              GATEWAY           MAC                LPORT  RHOST:PORT
VPCS1  10.1.1.2/24          0.0.0.0           00:50:79:66:68:01  10002  127.0.0.1:10003
       fe80::250:79ff:fe66:6801/64
```

ğŸŒ **Effectuer un `ping` d'une machine Ã  l'autre**

node1.tp1.efrei
```
VPCS> ping 10.1.1.2
84 bytes from 10.1.1.2 icmp_seq=1 ttl=64 time=1.415 ms
84 bytes from 10.1.1.2 icmp_seq=2 ttl=64 time=1.502 ms
84 bytes from 10.1.1.2 icmp_seq=3 ttl=64 time=1.647 ms
84 bytes from 10.1.1.2 icmp_seq=4 ttl=64 time=1.620 ms
84 bytes from 10.1.1.2 icmp_seq=5 ttl=64 time=1.409 ms
```

## 5. Analyze

ğŸŒ **Protocolz ?**

```
ARP
```

ğŸ“ **`p1_ping.pcap`** 




